app/Controllers/Setting.php

SELECT `name`, `city`, `code`
FROM `airport`
ORDER BY `name` ASC
---
    public function airport()
    {
        $builder    = $this->db->table('airport');
        $data       = [
            'title'         => 'Pengaturan Cabang',
            'breadcrumb'    => [
                ['Pengaturan', '/pengaturan'],
                ['Cabang', '/pengaturan/cabang']
            ],
            'contents'      => []
        ];

        $data['contents'] = $builder->select('name, city, code')
        ->orderBy('name', 'ASC')
        ->get()
        ->getResult('array');

SELECT `title`, `images`
FROM `album`
ORDER BY `title` ASC
---
    public function gallery()
    {
        $builder    = $this->db->table('album');
        $data       = [
            'title'         => 'Pengaturan Galeri',
            'breadcrumb'    => [
                ['Pengaturan', '/pengaturan'],
                ['Galeri', '/pengaturan/galeri']
            ],
            'contents'      => []
        ];

        $sqlQuery = $builder
        ->select('title, images')
        ->orderBy('title', 'ASC')
        ->get()
        ->getResult('array');

SELECT `images`
FROM `album`
WHERE `title` = 'Test'
DELETE FROM `album`
WHERE `title` = 'Test'
---
    public function delGallery()
    {
        $builder    = $this->db->table('album');
        $title      = urldecode($this->request->getGet('q'));
        $sqlQuery   = $builder
        ->select('images')
        ->getWhere(['title' => $title])
        ->getRow('images');

        if(!empty($sqlQuery) || $sqlQuery != null) {
            $temp = json_decode($sqlQuery);

            if($builder->delete(['title' => $title])) {

SELECT `id`, `name`, `logo`
FROM `partner`
ORDER BY `name` ASC
---
    public function partner()
    {
        $builder    = $this->db->table('partner');
        $data       = [
            'title'         => 'Pengaturan Mitra',
            'breadcrumb'    => [
                ['Pengaturan', '/pengaturan'],
                ['Mitra', '/pengaturan/mitra']
            ],
            'contents'      => []
        ];

        $data['contents'] = $builder
        ->select('id, name, logo')
        ->orderBy('name', 'ASC')
        ->get()
        ->getResult('array');

SELECT `email`, `username`, `hint`
FROM `user`
WHERE `id` = 1
---
    public function account()
    {
        $builder    = $this->db->table('user');
        $data       = [
            'title'         => 'Pengaturan Akun',
            'breadcrumb'    => [
                ['Pengaturan', '/pengaturan'],
                ['Akun', '/pengaturan/akun']
            ],
            'contents'      => []
        ];

        $data['contents'] = $builder
        ->select('email, username, hint')
        ->getWhere(['id' => 1])
        ->getRow();